Revit 2027 API
ViewSchedule.CreateSchedule Method
Overload List
Name | Description
CreateSchedule(Document, ElementId) |  Creates a regular schedule.
CreateSchedule(Document, ElementId, ElementId) |  Creates a regular schedule that can relate to a specific area scheme.
Top
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace